---
kind: other
id: Methods.T:Autodesk.Revit.DB.Structure.IExtElemChangeBeamSection
source: html/153c999a-fd1e-7705-c431-f2181f01483d.htm
---
# IExtElemChangeBeamSection Methods

The method that will be called when user wants to change beam section